# BackgroundPatternColorParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BackgroundPatternColorParam Property
ParameterTypeId Class See Also
---
"Background Pattern Color"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BackgroundPatternColorParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BackgroundPatternColorParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BackgroundPatternColorParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace